micropython/micropython/ports/wch/bsp/src/ch32v30x_dma.c
    return bitstatus;
}

/*********************************************************************
 * @fn      DMA_ClearFlag
 *
 * @brief   Clears the DMAy Channelx's pending flags.
 *
 * @param   DMAy_FLAG - specifies the flag to check.
 *            DMA1_FLAG_GL1 - DMA1 Channel1 global flag.
 *            DMA1_FLAG_TC1 - DMA1 Channel1 transfer complete flag.
 *            DMA1_FLAG_HT1 - DMA1 Channel1 half transfer flag.
 *            DMA1_FLAG_TE1 - DMA1 Channel1 transfer error flag.
 *            DMA1_FLAG_GL2 - DMA1 Channel2 global flag.
 *            DMA1_FLAG_TC2 - DMA1 Channel2 transfer complete flag.
 *            DMA1_FLAG_HT2 - DMA1 Channel2 half transfer flag.
 *            DMA1_FLAG_TE2 - DMA1 Channel2 transfer error flag.
 *            DMA1_FLAG_GL3 - DMA1 Channel3 global flag.
 *            DMA1_FLAG_TC3 - DMA1 Channel3 transfer complete flag.
 *            DMA1_FLAG_HT3 - DMA1 Channel3 half transfer flag.
 *            DMA1_FLAG_TE3 - DMA1 Channel3 transfer error flag.
 *            DMA1_FLAG_GL4 - DMA1 Channel4 global flag.
 *            DMA1_FLAG_TC4 - DMA1 Channel4 transfer complete flag.
 *            DMA1_FLAG_HT4 - DMA1 Channel4 half transfer flag.
 *            DMA1_FLAG_TE4 - DMA1 Channel4 transfer error flag.
 *            DMA1_FLAG_GL5 - DMA1 Channel5 global flag.
 *            DMA1_FLAG_TC5 - DMA1 Channel5 transfer complete flag.
 *            DMA1_FLAG_HT5 - DMA1 Channel5 half transfer flag.
 *            DMA1_FLAG_TE5 - DMA1 Channel5 transfer error flag.
 *            DMA1_FLAG_GL6 - DMA1 Channel6 global flag.
 *            DMA1_FLAG_TC6 - DMA1 Channel6 transfer complete flag.
 *            DMA1_FLAG_HT6 - DMA1 Channel6 half transfer flag.
 *            DMA1_FLAG_TE6 - DMA1 Channel6 transfer error flag.
 *            DMA1_FLAG_GL7 - DMA1 Channel7 global flag.
 *            DMA1_FLAG_TC7 - DMA1 Channel7 transfer complete flag.
 *            DMA1_FLAG_HT7 - DMA1 Channel7 half transfer flag.
 *            DMA1_FLAG_TE7 - DMA1 Channel7 transfer error flag.
 *            DMA2_FLAG_GL1 - DMA2 Channel1 global flag.
 *            DMA2_FLAG_TC1 - DMA2 Channel1 transfer complete flag.
 *            DMA2_FLAG_HT1 - DMA2 Channel1 half transfer flag.
 *            DMA2_FLAG_TE1 - DMA2 Channel1 transfer error flag.
 *            DMA2_FLAG_GL2 - DMA2 Channel2 global flag.
 *            DMA2_FLAG_TC2 - DMA2 Channel2 transfer complete flag.
 *            DMA2_FLAG_HT2 - DMA2 Channel2 half transfer flag.
 *            DMA2_FLAG_TE2 - DMA2 Channel2 transfer error flag.
 *            DMA2_FLAG_GL3 - DMA2 Channel3 global flag.
 *            DMA2_FLAG_TC3 - DMA2 Channel3 transfer complete flag.
 *            DMA2_FLAG_HT3 - DMA2 Channel3 half transfer flag.
 *            DMA2_FLAG_TE3 - DMA2 Channel3 transfer error flag.
 *            DMA2_FLAG_GL4 - DMA2 Channel4 global flag.
 *            DMA2_FLAG_TC4 - DMA2 Channel4 transfer complete flag.
 *            DMA2_FLAG_HT4 - DMA2 Channel4 half transfer flag.
 *            DMA2_FLAG_TE4 - DMA2 Channel4 transfer error flag.
 *            DMA2_FLAG_GL5 - DMA2 Channel5 global flag.
 *            DMA2_FLAG_TC5 - DMA2 Channel5 transfer complete flag.
 *            DMA2_FLAG_HT5 - DMA2 Channel5 half transfer flag.
 *            DMA2_FLAG_TE5 - DMA2 Channel5 transfer error flag.
 *            DMA2_FLAG_GL6 - DMA2 Channel6 global flag.
 *            DMA2_FLAG_TC6 - DMA2 Channel6 transfer complete flag.
 *            DMA2_FLAG_HT6 - DMA2 Channel6 half transfer flag.
 *            DMA2_FLAG_TE6 - DMA2 Channel6 transfer error flag.
 *            DMA2_FLAG_GL7 - DMA2 Channel7 global flag.
 *            DMA2_FLAG_TC7 - DMA2 Channel7 transfer complete flag.
 *            DMA2_FLAG_HT7 - DMA2 Channel7 half transfer flag.
 *            DMA2_FLAG_TE7 - DMA2 Channel7 transfer error flag.
 *            DMA2_FLAG_GL8 - DMA2 Channel8 global flag.
 *            DMA2_FLAG_TC8 - DMA2 Channel8 transfer complete flag.
 *            DMA2_FLAG_HT8 - DMA2 Channel8 half transfer flag.
 *            DMA2_FLAG_TE8 - DMA2 Channel8 transfer error flag.
 *            DMA2_FLAG_GL9 - DMA2 Channel9 global flag.
 *            DMA2_FLAG_TC9 - DMA2 Channel9 transfer complete flag.
 *            DMA2_FLAG_HT9 - DMA2 Channel9 half transfer flag.
 *            DMA2_FLAG_TE9 - DMA2 Channel9 transfer error flag.
 *            DMA2_FLAG_GL10 - DMA2 Channel10 global flag.
 *            DMA2_FLAG_TC10 - DMA2 Channel10 transfer complete flag.
 *            DMA2_FLAG_HT10 - DMA2 Channel10 half transfer flag.
 *            DMA2_FLAG_TE10 - DMA2 Channel10 transfer error flag.
 *            DMA2_FLAG_GL11 - DMA2 Channel11 global flag.
 *            DMA2_FLAG_TC11 - DMA2 Channel11 transfer complete flag.
 *            DMA2_FLAG_HT11 - DMA2 Channel11 half transfer flag.
 *            DMA2_FLAG_TE11 - DMA2 Channel11 transfer error flag.
 *
 * @return  none
 */
void DMA_ClearFlag(uint32_t DMAy_FLAG) {
    if ((DMAy_FLAG & FLAG_Mask) == FLAG_Mask) {
        DMA2->INTFCR = DMAy_FLAG;
    } else if ((DMAy_FLAG & DMA2_EXTEN_FLAG_Mask) == DMA2_EXTEN_FLAG_Mask) {
        DMA2_EXTEN->INTFCR = DMAy_FLAG;
    } else {
        DMA1->INTFCR = DMAy_FLAG;
    }
}

/*********************************************************************
 * @fn      DMA_GetITStatus
 *
 * @brief   Checks whether the specified DMAy Channelx interrupt has
 *        occurred or not.
 *
 * @param   DMAy_IT - specifies the DMAy interrupt source to check.
 *            DMA1_IT_GL1 - DMA1 Channel1 global flag.
 *            DMA1_IT_TC1 - DMA1 Channel1 transfer complete flag.
 *            DMA1_IT_HT1 - DMA1 Channel1 half transfer flag.
 *            DMA1_IT_TE1 - DMA1 Channel1 transfer error flag.
 *            DMA1_IT_GL2 - DMA1 Channel2 global flag.
 *            DMA1_IT_TC2 - DMA1 Channel2 transfer complete flag.
 *            DMA1_IT_HT2 - DMA1 Channel2 half transfer flag.
 *            DMA1_IT_TE2 - DMA1 Channel2 transfer error flag.
 *            DMA1_IT_GL3 - DMA1 Channel3 global flag.
 *            DMA1_IT_TC3 - DMA1 Channel3 transfer complete flag.
 *            DMA1_IT_HT3 - DMA1 Channel3 half transfer flag.
 *            DMA1_IT_TE3 - DMA1 Channel3 transfer error flag.
 *            DMA1_IT_GL4 - DMA1 Channel4 global flag.
 *            DMA1_IT_TC4 - DMA1 Channel4 transfer complete flag.
 *            DMA1_IT_HT4 - DMA1 Channel4 half transfer flag.
 *            DMA1_IT_TE4 - DMA1 Channel4 transfer error flag.
 *            DMA1_IT_GL5 - DMA1 Channel5 global flag.
 *            DMA1_IT_TC5 - DMA1 Channel5 transfer complete flag.
 *            DMA1_IT_HT5 - DMA1 Channel5 half transfer flag.
 *            DMA1_IT_TE5 - DMA1 Channel5 transfer error flag.
 *            DMA1_IT_GL6 - DMA1 Channel6 global flag.
 *            DMA1_IT_TC6 - DMA1 Channel6 transfer complete flag.
 *            DMA1_IT_HT6 - DMA1 Channel6 half transfer flag.
 *            DMA1_IT_TE6 - DMA1 Channel6 transfer error flag.
 *            DMA1_IT_GL7 - DMA1 Channel7 global flag.
 *            DMA1_IT_TC7 - DMA1 Channel7 transfer complete flag.
 *            DMA1_IT_HT7 - DMA1 Channel7 half transfer flag.
 *            DMA1_IT_TE7 - DMA1 Channel7 transfer error flag.
 *            DMA2_IT_GL1 - DMA2 Channel1 global flag.
 *            DMA2_IT_TC1 - DMA2 Channel1 transfer complete flag.
 *            DMA2_IT_HT1 - DMA2 Channel1 half transfer flag.
 *            DMA2_IT_TE1 - DMA2 Channel1 transfer error flag.
 *            DMA2_IT_GL2 - DMA2 Channel2 global flag.
 *            DMA2_IT_TC2 - DMA2 Channel2 transfer complete flag.
 *            DMA2_IT_HT2 - DMA2 Channel2 half transfer flag.
 *            DMA2_IT_TE2 - DMA2 Channel2 transfer error flag.
 *            DMA2_IT_GL3 - DMA2 Channel3 global flag.
 *            DMA2_IT_TC3 - DMA2 Channel3 transfer complete flag.
 *            DMA2_IT_HT3 - DMA2 Channel3 half transfer flag.
 *            DMA2_IT_TE3 - DMA2 Channel3 transfer error flag.
 *            DMA2_IT_GL4 - DMA2 Channel4 global flag.
 *            DMA2_IT_TC4 - DMA2 Channel4 transfer complete flag.
 *            DMA2_IT_HT4 - DMA2 Channel4 half transfer flag.
 *            DMA2_IT_TE4 - DMA2 Channel4 transfer error flag.
 *            DMA2_IT_GL5 - DMA2 Channel5 global flag.
 *            DMA2_IT_TC5 - DMA2 Channel5 transfer complete flag.
 *            DMA2_IT_HT5 - DMA2 Channel5 half transfer flag.
 *            DMA2_IT_TE5 - DMA2 Channel5 transfer error flag.
 *            DMA2_IT_GL6 - DMA2 Channel6 global flag.
 *            DMA2_IT_TC6 - DMA2 Channel6 transfer complete flag.
 *            DMA2_IT_HT6 - DMA2 Channel6 half transfer flag.
 *            DMA2_IT_TE6 - DMA2 Channel6 transfer error flag.
 *            DMA2_IT_GL7 - DMA2 Channel7 global flag.
 *            DMA2_IT_TC7 - DMA2 Channel7 transfer complete flag.
 *            DMA2_IT_HT7 - DMA2 Channel7 half transfer flag.
 *            DMA2_IT_TE7 - DMA2 Channel7 transfer error flag.
 *            DMA2_IT_GL8 - DMA2 Channel8 global flag.
 *            DMA2_IT_TC8 - DMA2 Channel8 transfer complete flag.
 *            DMA2_IT_HT8 - DMA2 Channel8 half transfer flag.
 *            DMA2_IT_TE8 - DMA2 Channel8 transfer error flag.
 *            DMA2_IT_GL9 - DMA2 Channel9 global flag.
 *            DMA2_IT_TC9 - DMA2 Channel9 transfer complete flag.
 *            DMA2_IT_HT9 - DMA2 Channel9 half transfer flag.
 *            DMA2_IT_TE9 - DMA2 Channel9 transfer error flag.
 *            DMA2_IT_GL10 - DMA2 Channel10 global flag.
 *            DMA2_IT_TC10 - DMA2 Channel10 transfer complete flag.
 *            DMA2_IT_HT10 - DMA2 Channel10 half transfer flag.
 *            DMA2_IT_TE10 - DMA2 Channel10 transfer error flag.
 *            DMA2_IT_GL11 - DMA2 Channel11 global flag.
 *            DMA2_IT_TC11 - DMA2 Channel11 transfer complete flag.
 *            DMA2_IT_HT11 - DMA2 Channel11 half transfer flag.
 *            DMA2_IT_TE11 - DMA2 Channel11 transfer error flag.
 *
 * @return  The new state of DMAy_IT (SET or RESET).
 */
ITStatus DMA_GetITStatus(uint32_t DMAy_IT) {
    ITStatus bitstatus = RESET;
    uint32_t tmpreg = 0;

    if ((DMAy_IT & FLAG_Mask) == FLAG_Mask) {
        tmpreg = DMA2->INTFR;
    } else if ((DMAy_IT & DMA2_EXTEN_FLAG_Mask) == DMA2_EXTEN_FLAG_Mask) {
        tmpreg = DMA2_EXTEN->INTFR;
    } else {
        tmpreg = DMA1->INTFR;
    }

    if ((tmpreg & DMAy_IT) != (uint32_t)RESET) {
        bitstatus = SET;
    } else {
        bitstatus = RESET;
    }
    return bitstatus;
}

/*********************************************************************
 * @fn      DMA_ClearITPendingBit
 *
 * @brief   Clears the DMAy Channelx's interrupt pending bits.
 *
 * @param   DMAy_IT - specifies the DMAy interrupt source to check.
 *            DMA1_IT_GL1 - DMA1 Channel1 global flag.
 *            DMA1_IT_TC1 - DMA1 Channel1 transfer complete flag.
 *            DMA1_IT_HT1 - DMA1 Channel1 half transfer flag.
 *            DMA1_IT_TE1 - DMA1 Channel1 transfer error flag.
 *            DMA1_IT_GL2 - DMA1 Channel2 global flag.
 *            DMA1_IT_TC2 - DMA1 Channel2 transfer complete flag.
 *            DMA1_IT_HT2 - DMA1 Channel2 half transfer flag.
 *            DMA1_IT_TE2 - DMA1 Channel2 transfer error flag.
 *            DMA1_IT_GL3 - DMA1 Channel3 global flag.
 *            DMA1_IT_TC3 - DMA1 Channel3 transfer complete flag.
 *            DMA1_IT_HT3 - DMA1 Channel3 half transfer flag.
 *            DMA1_IT_TE3 - DMA1 Channel3 transfer error flag.
 *            DMA1_IT_GL4 - DMA1 Channel4 global flag.
 *            DMA1_IT_TC4 - DMA1 Channel4 transfer complete flag.
 *            DMA1_IT_HT4 - DMA1 Channel4 half transfer flag.
 *            DMA1_IT_TE4 - DMA1 Channel4 transfer error flag.
 *            DMA1_IT_GL5 - DMA1 Channel5 global flag.
 *            DMA1_IT_TC5 - DMA1 Channel5 transfer complete flag.
 *            DMA1_IT_HT5 - DMA1 Channel5 half transfer flag.
 *            DMA1_IT_TE5 - DMA1 Channel5 transfer error flag.
 *            DMA1_IT_GL6 - DMA1 Channel6 global flag.
 *            DMA1_IT_TC6 - DMA1 Channel6 transfer complete flag.
 *            DMA1_IT_HT6 - DMA1 Channel6 half transfer flag.
 *            DMA1_IT_TE6 - DMA1 Channel6 transfer error flag.
 *            DMA1_IT_GL7 - DMA1 Channel7 global flag.
 *            DMA1_IT_TC7 - DMA1 Channel7 transfer complete flag.
 *            DMA1_IT_HT7 - DMA1 Channel7 half transfer flag.
 *            DMA1_IT_TE7 - DMA1 Channel7 transfer error flag.
 *            DMA2_IT_GL1 - DMA2 Channel1 global flag.
 *            DMA2_IT_TC1 - DMA2 Channel1 transfer complete flag.
 *            DMA2_IT_HT1 - DMA2 Channel1 half transfer flag.
 *            DMA2_IT_TE1 - DMA2 Channel1 transfer error flag.
 *            DMA2_IT_GL2 - DMA2 Channel2 global flag.
 *            DMA2_IT_TC2 - DMA2 Channel2 transfer complete flag.
 *            DMA2_IT_HT2 - DMA2 Channel2 half transfer flag.
 *            DMA2_IT_TE2 - DMA2 Channel2 transfer error flag.
 *            DMA2_IT_GL3 - DMA2 Channel3 global flag.
 *            DMA2_IT_TC3 - DMA2 Channel3 transfer complete flag.
 *            DMA2_IT_HT3 - DMA2 Channel3 half transfer flag.
 *            DMA2_IT_TE3 - DMA2 Channel3 transfer error flag.
 *            DMA2_IT_GL4 - DMA2 Channel4 global flag.
 *            DMA2_IT_TC4 - DMA2 Channel4 transfer complete flag.
 *            DMA2_IT_HT4 - DMA2 Channel4 half transfer flag.
 *            DMA2_IT_TE4 - DMA2 Channel4 transfer error flag.
 *            DMA2_IT_GL5 - DMA2 Channel5 global flag.
 *            DMA2_IT_TC5 - DMA2 Channel5 transfer complete flag.
 *            DMA2_IT_HT5 - DMA2 Channel5 half transfer flag.
 *            DMA2_IT_TE5 - DMA2 Channel5 transfer error flag.
 *            DMA2_IT_GL6 - DMA2 Channel6 global flag.
 *            DMA2_IT_TC6 - DMA2 Channel6 transfer complete flag.
 *            DMA2_IT_HT6 - DMA2 Channel6 half transfer flag.
 *            DMA2_IT_TE6 - DMA2 Channel6 transfer error flag.
 *            DMA2_IT_GL7 - DMA2 Channel7 global flag.
 *            DMA2_IT_TC7 - DMA2 Channel7 transfer complete flag.
 *            DMA2_IT_HT7 - DMA2 Channel7 half transfer flag.
 *            DMA2_IT_TE7 - DMA2 Channel7 transfer error flag.
 *            DMA2_IT_GL8 - DMA2 Channel8 global flag.
 *            DMA2_IT_TC8 - DMA2 Channel8 transfer complete flag.
 *            DMA2_IT_HT8 - DMA2 Channel8 half transfer flag.
 *            DMA2_IT_TE8 - DMA2 Channel8 transfer error flag.
 *            DMA2_IT_GL9 - DMA2 Channel9 global flag.
 *            DMA2_IT_TC9 - DMA2 Channel9 transfer complete flag.
 *            DMA2_IT_HT9 - DMA2 Channel9 half transfer flag.
 *            DMA2_IT_TE9 - DMA2 Channel9 transfer error flag.
 *            DMA2_IT_GL10 - DMA2 Channel10 global flag.
 *            DMA2_IT_TC10 - DMA2 Channel10 transfer complete flag.
 *            DMA2_IT_HT10 - DMA2 Channel10 half transfer flag.
 *            DMA2_IT_TE10 - DMA2 Channel10 transfer error flag.
 *            DMA2_IT_GL11 - DMA2 Channel11 global flag.
 *            DMA2_IT_TC11 - DMA2 Channel11 transfer complete flag.
 *            DMA2_IT_HT11 - DMA2 Channel11 half transfer flag.
 *            DMA2_IT_TE11 - DMA2 Channel11 transfer error flag.
 *
 * @return  none
 */
void DMA_ClearITPendingBit(uint32_t DMAy_IT) {
    if ((DMAy_IT & FLAG_Mask) == FLAG_Mask) {
        DMA2->INTFCR = DMAy_IT;
    } else if ((DMAy_IT & DMA2_EXTEN_FLAG_Mask) == DMA2_EXTEN_FLAG_Mask) {
        DMA2_EXTEN->INTFCR = DMAy_IT;
    } else {
        DMA1->INTFCR = DMAy_IT;
    }
}
